## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.example_aws.aws_cloudwatch_log_group.this will be created
+   resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/batch/example-scheduled-jobs"
+       retention_in_days = 1
+       tags              = {
+           "resource" = "aws_cloudwatch_log_group.this"
        }
+       tags_all          = {
+           "managed-by" = "Terraform"
+           "resource"   = "aws_cloudwatch_log_group.this"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.aws_iam_role.ecs_task_execution_role will be created
+   resource "aws_iam_role" "ecs_task_execution_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "example-scheduled-jobs-ecs-task-exec"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "resource" = "aws_iam_role.ecs_task_execution_role"
        }
+       tags_all              = {
+           "managed-by" = "Terraform"
+           "resource"   = "aws_iam_role.ecs_task_execution_role"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.aws_iam_role_policy_attachment.ecs_task_execution_role will be created
+   resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
+       role       = "example-scheduled-jobs-ecs-task-exec"
    }

  # module.example_aws.aws_resourcegroups_group.workspace will be created
+   resource "aws_resourcegroups_group" "workspace" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "terraform-example_scheduled_jobs-dev_dex4er"
+       tags     = {
+           "Name" = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       tags_all = {
+           "Name"       = "terraform-example_scheduled_jobs-dev_dex4er"
+           "managed-by" = "Terraform"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }

+       resource_query {
+           query = jsonencode(
                {
+                   ResourceTypeFilters = [
+                       "AWS::AllSupported",
                    ]
+                   TagFilters          = [
+                       {
+                           Key    = "workspace"
+                           Values = [
+                               "terraform-example_scheduled_jobs-dev_dex4er",
                            ]
                        },
                    ]
                }
            )
+           type  = "TAG_FILTERS_1_0"
        }
    }

  # module.example_aws.module.batch.aws_batch_compute_environment.this["fargate_spot"] will be created
+   resource "aws_batch_compute_environment" "this" {
+       arn                             = (known after apply)
+       compute_environment_name        = (known after apply)
+       compute_environment_name_prefix = "fargate_spot-"
+       ecs_cluster_arn                 = (known after apply)
+       id                              = (known after apply)
+       service_role                    = (known after apply)
+       state                           = "ENABLED"
+       status                          = (known after apply)
+       status_reason                   = (known after apply)
+       tags                            = {
+           "compute_environments" = "fargate_spot"
+           "module"               = "batch"
        }
+       tags_all                        = {
+           "compute_environments" = "fargate_spot"
+           "managed-by"           = "Terraform"
+           "module"               = "batch"
+           "workspace"            = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       type                            = "MANAGED"

+       compute_resources {
+           allocation_strategy = (known after apply)
+           bid_percentage      = (known after apply)
+           desired_vcpus       = (known after apply)
+           ec2_key_pair        = (known after apply)
+           image_id            = (known after apply)
+           instance_role       = (known after apply)
+           instance_type       = (known after apply)
+           max_vcpus           = (known after apply)
+           min_vcpus           = (known after apply)
+           security_group_ids  = (known after apply)
+           spot_iam_fleet_role = (known after apply)
+           subnets             = (known after apply)
+           tags                = (known after apply)
+           type                = (known after apply)

+           ec2_configuration {
+               image_id_override = (known after apply)
+               image_type        = (known after apply)
            }

+           launch_template {
+               launch_template_id   = (known after apply)
+               launch_template_name = (known after apply)
+               version              = (known after apply)
            }
        }
    }

  # module.example_aws.module.batch.aws_batch_job_definition.this["example"] will be created
+   resource "aws_batch_job_definition" "this" {
+       arn                   = (known after apply)
+       container_properties  = (known after apply)
+       id                    = (known after apply)
+       name                  = "example-scheduled-jobs"
+       platform_capabilities = [
+           "FARGATE",
        ]
+       propagate_tags        = true
+       revision              = (known after apply)
+       tags                  = {
+           "job_definitions" = "example"
+           "module"          = "batch"
        }
+       tags_all              = {
+           "job_definitions" = "example"
+           "managed-by"      = "Terraform"
+           "module"          = "batch"
+           "workspace"       = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       type                  = "container"

+       timeout {
+           attempt_duration_seconds = 60
        }
    }

  # module.example_aws.module.batch.aws_batch_job_queue.this["fargate_spot"] will be created
+   resource "aws_batch_job_queue" "this" {
+       arn                   = (known after apply)
+       compute_environments  = (known after apply)
+       id                    = (known after apply)
+       name                  = "fargate_spot"
+       priority              = 99
+       scheduling_policy_arn = (known after apply)
+       state                 = "ENABLED"
+       tags                  = {
+           "job_queues" = "fargate_spot"
+           "module"     = "batch"
        }
+       tags_all              = {
+           "job_queues" = "fargate_spot"
+           "managed-by" = "Terraform"
+           "module"     = "batch"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.module.batch.aws_batch_scheduling_policy.this["fargate_spot"] will be created
+   resource "aws_batch_scheduling_policy" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "fargate_spot"
+       tags     = {
+           "job_queues" = "fargate_spot"
+           "module"     = "batch"
        }
+       tags_all = (known after apply)

+       fair_share_policy {
        }
    }

  # module.example_aws.module.batch.aws_iam_instance_profile.instance[0] will be created
+   resource "aws_iam_instance_profile" "instance" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "example-scheduled-jobs-ecs-instance-"
+       path        = "/batch/"
+       role        = (known after apply)
+       tags        = {
+           "ModuleCreatedRole" = "Yes"
+           "module"            = "batch"
        }
+       tags_all    = {
+           "ModuleCreatedRole" = "Yes"
+           "managed-by"        = "Terraform"
+           "module"            = "batch"
+           "workspace"         = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       unique_id   = (known after apply)
    }

  # module.example_aws.module.batch.aws_iam_role.instance[0] will be created
+   resource "aws_iam_role" "instance" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = "ECSAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "IAM instance role/profile for AWS Batch ECS instance(s)"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "example-scheduled-jobs-ecs-instance-"
+       path                  = "/batch/"
+       tags                  = {
+           "ModuleCreatedRole" = "Yes"
+           "module"            = "batch"
        }
+       tags_all              = {
+           "ModuleCreatedRole" = "Yes"
+           "managed-by"        = "Terraform"
+           "module"            = "batch"
+           "workspace"         = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.module.batch.aws_iam_role.service[0] will be created
+   resource "aws_iam_role" "service" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "batch.amazonaws.com"
                        }
+                       Sid       = "ECSAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "IAM service role for AWS Batch"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "example-scheduled-jobs-batch-"
+       path                  = "/batch/"
+       tags                  = {
+           "ModuleCreatedRole" = "Yes"
+           "module"            = "batch"
        }
+       tags_all              = {
+           "ModuleCreatedRole" = "Yes"
+           "managed-by"        = "Terraform"
+           "module"            = "batch"
+           "workspace"         = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.module.batch.aws_iam_role.spot_fleet[0] will be created
+   resource "aws_iam_role" "spot_fleet" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "spotfleet.amazonaws.com"
                        }
+                       Sid       = "ECSAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "IAM spot fleet role for AWS Batch"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "example-scheduled-jobs-spot-"
+       path                  = "/batch/"
+       tags                  = {
+           "ModuleCreatedRole" = "Yes"
+           "module"            = "batch"
        }
+       tags_all              = {
+           "ModuleCreatedRole" = "Yes"
+           "managed-by"        = "Terraform"
+           "module"            = "batch"
+           "workspace"         = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.example_aws.module.batch.aws_iam_role_policy_attachment.instance["arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"] will be created
+   resource "aws_iam_role_policy_attachment" "instance" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
+       role       = (known after apply)
    }

  # module.example_aws.module.batch.aws_iam_role_policy_attachment.service["arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"] will be created
+   resource "aws_iam_role_policy_attachment" "service" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
+       role       = (known after apply)
    }

  # module.example_aws.module.batch.aws_iam_role_policy_attachment.spot_fleet["arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetTaggingRole"] will be created
+   resource "aws_iam_role_policy_attachment" "spot_fleet" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2SpotFleetTaggingRole"
+       role       = (known after apply)
    }

  # module.example_aws.module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"   = "example-scheduled-jobs-default"
+           "module" = "vpc"
        }
+       tags_all               = {
+           "Name"       = "example-scheduled-jobs-default"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                 = (known after apply)
    }

  # module.example_aws.module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Name"   = "example-scheduled-jobs-us-east-1a"
+           "module" = "vpc"
        }
+       tags_all             = {
+           "Name"       = "example-scheduled-jobs-us-east-1a"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc                  = true
    }

  # module.example_aws.module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name"   = "example-scheduled-jobs"
+           "module" = "vpc"
        }
+       tags_all = {
+           "Name"       = "example-scheduled-jobs"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id   = (known after apply)
    }

  # module.example_aws.module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id        = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Name"   = "example-scheduled-jobs-us-east-1a"
+           "module" = "vpc"
        }
+       tags_all             = {
+           "Name"       = "example-scheduled-jobs-us-east-1a"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.example_aws.module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.example_aws.module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"   = "example-scheduled-jobs-private"
+           "module" = "vpc"
        }
+       tags_all         = {
+           "Name"       = "example-scheduled-jobs-private"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id           = (known after apply)
    }

  # module.example_aws.module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"   = "example-scheduled-jobs-public"
+           "module" = "vpc"
        }
+       tags_all         = {
+           "Name"       = "example-scheduled-jobs-public"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id           = (known after apply)
    }

  # module.example_aws.module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.example_aws.module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.example_aws.module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.example_aws.module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.example_aws.module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.example_aws.module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.example_aws.module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.99.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"   = "example-scheduled-jobs-private-us-east-1a"
+           "module" = "vpc"
        }
+       tags_all                                       = {
+           "Name"       = "example-scheduled-jobs-private-us-east-1a"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.example_aws.module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.99.4.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"   = "example-scheduled-jobs-private-us-east-1b"
+           "module" = "vpc"
        }
+       tags_all                                       = {
+           "Name"       = "example-scheduled-jobs-private-us-east-1b"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.example_aws.module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.99.5.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"   = "example-scheduled-jobs-private-us-east-1c"
+           "module" = "vpc"
        }
+       tags_all                                       = {
+           "Name"       = "example-scheduled-jobs-private-us-east-1c"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.example_aws.module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.99.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"   = "example-scheduled-jobs-public-us-east-1a"
+           "module" = "vpc"
        }
+       tags_all                                       = {
+           "Name"       = "example-scheduled-jobs-public-us-east-1a"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.example_aws.module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.99.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"   = "example-scheduled-jobs-public-us-east-1b"
+           "module" = "vpc"
        }
+       tags_all                                       = {
+           "Name"       = "example-scheduled-jobs-public-us-east-1b"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.example_aws.module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.99.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"   = "example-scheduled-jobs-public-us-east-1c"
+           "module" = "vpc"
        }
+       tags_all                                       = {
+           "Name"       = "example-scheduled-jobs-public-us-east-1c"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.example_aws.module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       assign_generated_ipv6_cidr_block     = false
+       cidr_block                           = "10.99.0.0/18"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name"   = "example-scheduled-jobs"
+           "module" = "vpc"
        }
+       tags_all                             = {
+           "Name"       = "example-scheduled-jobs"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.module.vpc.aws_vpc_dhcp_options.this[0] will be created
+   resource "aws_vpc_dhcp_options" "this" {
+       arn                  = (known after apply)
+       domain_name          = "ec2.internal"
+       domain_name_servers  = [
+           "AmazonProvidedDNS",
        ]
+       id                   = (known after apply)
+       netbios_name_servers = []
+       ntp_servers          = []
+       owner_id             = (known after apply)
+       tags                 = {
+           "Name"   = "example-scheduled-jobs"
+           "module" = "vpc"
        }
+       tags_all             = {
+           "Name"       = "example-scheduled-jobs"
+           "managed-by" = "Terraform"
+           "module"     = "vpc"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.module.vpc.aws_vpc_dhcp_options_association.this[0] will be created
+   resource "aws_vpc_dhcp_options_association" "this" {
+       dhcp_options_id = (known after apply)
+       id              = (known after apply)
+       vpc_id          = (known after apply)
    }

  # module.example_aws.module.vpc_endpoint_security_group.aws_security_group.this_name_prefix[0] will be created
+   resource "aws_security_group" "this_name_prefix" {
+       arn                    = (known after apply)
+       description            = "Security group for VPC endpoints"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "example-scheduled-jobs-vpc-endpoint-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"   = "example-scheduled-jobs-vpc-endpoint"
+           "module" = "vpc_endpoint_security_group"
        }
+       tags_all               = {
+           "Name"       = "example-scheduled-jobs-vpc-endpoint"
+           "managed-by" = "Terraform"
+           "module"     = "vpc_endpoint_security_group"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.example_aws.module.vpc_endpoint_security_group.aws_security_group_rule.egress_rules[0] will be created
+   resource "aws_security_group_rule" "egress_rules" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "HTTPS"
+       from_port                = 443
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.example_aws.module.vpc_endpoint_security_group.aws_security_group_rule.ingress_with_self[0] will be created
+   resource "aws_security_group_rule" "ingress_with_self" {
+       description              = "Container to VPC endpoint service"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.example_aws.module.vpc_endpoints.aws_vpc_endpoint.this["ecr_api"] will be created
+   resource "aws_vpc_endpoint" "this" {
+       arn                   = (known after apply)
+       cidr_blocks           = (known after apply)
+       dns_entry             = (known after apply)
+       id                    = (known after apply)
+       ip_address_type       = (known after apply)
+       network_interface_ids = (known after apply)
+       owner_id              = (known after apply)
+       policy                = (known after apply)
+       prefix_list_id        = (known after apply)
+       private_dns_enabled   = true
+       requester_managed     = (known after apply)
+       route_table_ids       = (known after apply)
+       security_group_ids    = (known after apply)
+       service_name          = "com.amazonaws.us-east-1.ecr.api"
+       state                 = (known after apply)
+       subnet_ids            = (known after apply)
+       tags                  = {
+           "module" = "vpc_endpoints"
        }
+       tags_all              = {
+           "managed-by" = "Terraform"
+           "module"     = "vpc_endpoints"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_endpoint_type     = "Interface"
+       vpc_id                = (known after apply)

+       dns_options {
+           dns_record_ip_type = (known after apply)
        }

+       timeouts {
+           create = "10m"
+           delete = "10m"
+           update = "10m"
        }
    }

  # module.example_aws.module.vpc_endpoints.aws_vpc_endpoint.this["ecr_dkr"] will be created
+   resource "aws_vpc_endpoint" "this" {
+       arn                   = (known after apply)
+       cidr_blocks           = (known after apply)
+       dns_entry             = (known after apply)
+       id                    = (known after apply)
+       ip_address_type       = (known after apply)
+       network_interface_ids = (known after apply)
+       owner_id              = (known after apply)
+       policy                = (known after apply)
+       prefix_list_id        = (known after apply)
+       private_dns_enabled   = true
+       requester_managed     = (known after apply)
+       route_table_ids       = (known after apply)
+       security_group_ids    = (known after apply)
+       service_name          = "com.amazonaws.us-east-1.ecr.dkr"
+       state                 = (known after apply)
+       subnet_ids            = (known after apply)
+       tags                  = {
+           "module" = "vpc_endpoints"
        }
+       tags_all              = {
+           "managed-by" = "Terraform"
+           "module"     = "vpc_endpoints"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_endpoint_type     = "Interface"
+       vpc_id                = (known after apply)

+       dns_options {
+           dns_record_ip_type = (known after apply)
        }

+       timeouts {
+           create = "10m"
+           delete = "10m"
+           update = "10m"
        }
    }

  # module.example_aws.module.vpc_endpoints.aws_vpc_endpoint.this["s3"] will be created
+   resource "aws_vpc_endpoint" "this" {
+       arn                   = (known after apply)
+       cidr_blocks           = (known after apply)
+       dns_entry             = (known after apply)
+       id                    = (known after apply)
+       ip_address_type       = (known after apply)
+       network_interface_ids = (known after apply)
+       owner_id              = (known after apply)
+       policy                = (known after apply)
+       prefix_list_id        = (known after apply)
+       private_dns_enabled   = false
+       requester_managed     = (known after apply)
+       route_table_ids       = (known after apply)
+       security_group_ids    = (known after apply)
+       service_name          = "com.amazonaws.us-east-1.s3"
+       state                 = (known after apply)
+       subnet_ids            = (known after apply)
+       tags                  = {
+           "module" = "vpc_endpoints"
        }
+       tags_all              = {
+           "managed-by" = "Terraform"
+           "module"     = "vpc_endpoints"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       vpc_endpoint_type     = "Gateway"
+       vpc_id                = (known after apply)

+       dns_options {
+           dns_record_ip_type = (known after apply)
        }

+       timeouts {
+           create = "10m"
+           delete = "10m"
+           update = "10m"
        }
    }

Plan: 44 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   aws_caller_identity_arn = "arn:aws:sts::376942697097:assumed-role/terraform-example_scheduled_jobs-dev_dex4er/Terraform"
+   terraform_workspace     = "terraform-example_scheduled_jobs-dev_dex4er"

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

